# Каждый следующий элемент ряда Фибоначчи получается
# при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:
#
# 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
#
# Найдите сумму всех четных элементов ряда Фибоначчи,
# которые не превышают четыре миллиона.

# Each new term in the Fibonacci sequence
# is generated by adding the previous two terms.
# By starting with 1 and 2, the first 10 terms will be:
#
# 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
#
# By considering the terms in the Fibonacci sequence whose values
# do not exceed four million, find the sum of the even-valued terms.


a, b = 1, 2
fib = [1, 2]
fib_even = []

while b < 4 * 10 ** 6:
    if a % 2 == 0:
        fib_even.append(a)
    if b % 2 == 0:
        fib_even.append(b)
    a = a + b
    b = a + b
    if a > 4 * 10 ** 6:
        break
    fib.append(a)
    fib.append(b)

print(sum(fib_even))

# Answer - 4613732
